Repository: staffim/BehatMailExtension
Catalog: i18n/*.xliff
Languages: ru

# iSignInToSmtpServer
source: /^(?:|I )sign in to "(?P<mailServer>[^"]*)" smtp server with "(?P<user>[^"]*)" and "(?P<password>[^"]*)"$/
ru: /^(?:|я )авториз(уюсь|овался) на "(?P<mailServer>[^"]*)" почтовом smtp сервере с "(?P<user>[^"]*)" и "(?P<password>[^"]*)"$/

source: /^(?:|I )sign out from mail server$/
ru: /^(?:|я )выхожу с почтового сервера$/

source: /^(?:|I )remove mail messages$/
ru: /^(?:|я )удал(яю|ил) письма с почтового ящика$/

source: /^(?:|I )remove mail messages from server$/
ru: /^(?:|я )удал(яю|ил) письма с сервера почты$/

# iReplyWithMessage
source: /^(?:|I )reply with "(?P<text>(?:[^"]|\\")*)"$/
ru: /^(?:|я )отправляю ответ с текстом "(?P<text>(?:[^"]|\\")*)"$/

# iReplyWithAttach
source: /^(?:|I )reply with "(?P<text>(?:[^"]|\\")*)" and attach "(?P<filename>(?:[^"]|\\")*)"$/
ru: /^(?:|я )отправляю ответ с текстом "(?P<text>(?:[^"]|\\")*)" и вложением "(?P<filename>(?:[^"]|\\")*)"$/

# iSendMail
source: /^(?:|I )send mail with subject "(?P<subject>(?:[^"]|\\")*)" and body "(?P<body>(?:[^"]|\\")*)" to address "(?P<to>(?:[^"]|\\")*)" from "(?P<from>(?:[^"]|\\")*)"$/
ru: /^(?:|я )отправляю письмо с темой "(?P<subject>(?:[^"]|\\")*)" и текстом "(?P<body>(?:[^"]|\\")*)" по адресу "(?P<to>(?:[^"]|\\")*)" от "(?P<from>(?:[^"]|\\")*)"$/

# iReplyWithTextMessage
source: /^(?:|I )reply with:$/
ru: /^(?:|я )отправляю ответ:$/

# iSendMailFromFile
source: /^(?:|I )send mail from file "(?P<filename>(?:[^"]|\\")*)"$/
ru: /^(?:|я )отправляю письмо из файла "(?P<filename>(?:[^"]|\\")*)"$/

# iReplyWithMessageFromFile
source: /^(?:|I )reply with message from file "(?P<filename>(?:[^"]|\\")*)"$/
ru: /^(?:|я )отправляю ответное письмо из файла "(?P<filename>(?:[^"]|\\")*)"$/

# iGoToMailMessag
source: /^(?:|I )go to "(?P<subject>(?:[^"]|\\")*)" mail message$/
ru: /^(?:|я )открываю письмо "(?P<subject>(?:[^"]|\\")*)"$/

# iGoToMailMessageWithInRecipients
source: /^(?:|I )go to mail message with "(?P<address>(?:[^"]|\\")*)" in recipients$/
ru: /^(?:|я )открываю письмо, адресованное "(?P<address>(?:[^"]|\\")*)"$/

source: /^(?:|I )receive mail messages$/
ru: /^(?:|я )получ(ил|аю) почту$/

# iShouldSeeNewMailMessagesAfterSeconds
source: /^(?:|I )should see (?P<count>\d+) new mail messag(e|es) after (?P<time>\d+) seconds$/
ru: /^(?:|я )должен видеть (?P<count>\d+) нов(ых|ое) пис(ем|ьма|ьмо) через (?P<time>\d+) секунд(|ы)$/

# iShouldSeeNewMailMessagesAfterWaiting
source: /^(?:|I )should see (?P<count>\d+) new mail messag(e|es) after waiting$/
ru: /^(?:|я )должен видеть (?P<count>\d+) нов(ых|ое) пис(ем|ьма|ьмо)$/

# iShouldSeeMailMessages
source: /^(?:|I )should see (?P<count>\d+) messag(e|es)$/
ru: /^(?:|я )должен видеть (?P<count>\d+) пис(ем|ьма|ьмо)$/

# iShouldSeeMailMessageWithTextInSubject
source: /^(?:|I )should see mail message with "(?P<text>(?:[^"]|\\")*)" in subject$/
ru: /^(?:|я )должен видеть письмо с "(?P<text>(?:[^"]|\\")*)" в теме$/

# iShouldSeeMailMessageWithSubject
source: /^(?:|I )should see mail message with subject "(?P<subject>(?:[^"]|\\")*)"$/
ru: /^(?:|я )должен видеть письмо с темой "(?P<subject>(?:[^"]|\\")*)"$/

# iShouldSeeInMailMessage
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in mail message$/
ru: /^(?:|я )должен видеть "(?P<text>(?:[^"]|\\")*)" в письме$/

# iShouldSeeAsReplyAddress
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" as reply address in mail message$/
ru: /^(?:|я )должен видеть "(?P<text>(?:[^"]|\\")*)" в адресе отправителя письма$/

# iShouldSeeMailMessageWithAddressInRecepients
source: /^(?:|I )should see mail message with "(?P<address>(?:[^"]|\\")*)" in recipients$/
ru: /^(?:|я )должен видеть письмо, адресованное "(?P<address>(?:[^"]|\\")*)"$/

# iShouldSeeAttachment
source: /^(?:|I )should see attachment "(?P<text>(?:[^"]|\\")*)" in mail message$/
ru: /^(?:|я )должен видеть прикрепленный к письму файл "(?P<text>(?:[^"]|\\")*)"$/

source: /^(?:|I )should see the date after "([^"]*)" in "([^"]*)" format$/
ru: /^(?:|я )должен видеть дату через "([^"]*)" в формате "([^"]*)"/

# iFollowLinkInMailMessage
source: /^(?:|I )follow "(?P<linkPattern>(?:[^"]|\\")*)" from mail message$/
ru: /^(?:|я )перехожу по ссылке "(?P<linkPattern>(?:[^"]|\\")*)" из письма$/

# iFillInFromMailValue
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" by pattern "(?P<pattern>(?:[^"]|\\")*)" from mail body$/
ru: /^(?:|я )заполняю поле "(?P<field>(?:[^"]|\\")*)" по шаблону "(?P<pattern>(?:[^"]|\\")*)" из тела письма$/
